#!/bin/bash
exit 0
# -------------------------------------------------------

### ============================= 常用 =============================

### 快速打包本地資料夾所有檔案 (並用 gzip 壓縮)
tar czf all.tar.gz *

### 解壓縮回來
tar zxf all.tar.gz

### =============================  =============================

### 壓縮打包系統資料時, 務必加上 「`P`」, 去除絕對路徑
tar -jtvf /root/etc.tar.bz2
#drwxr-xr-x root/root 0 2018-07-08 13:20 etc/
#-rw-r--r-- root/root 617 2018-02-27 13:45 etc/fstab
#-rw------- root/root 0 2018-02-27 13:45 etc/crypttab
(...略...) # ↑ @@
# 注意!! 最右邊的路徑, 都已經移除了 根目錄的絕對路徑「/」
# 目的很明瞭~  防止解壓縮之後, 解壓縮的檔案們會跑回絕對路徑, 把最新的資料蓋掉
