# [Strings](http://www.runoob.com/redis/redis-strings.html)


```bash
> set a 5
OK
> get a
"5"

# getset key value
> getset db mysql
(nil)
> getset db mongo
"mysql"
> getset db redis
"mongo"
> get db
"redis"

# getrange key start end
> getrange db 0 3
"redi"

# getbit key offset
# (pass)

# mget key [key ...]
> set key1 "hello"
OK
> set key2 "world"
OK
> mget key1 key2 key3
1) "hello"
2) "world"
3) (nil)

# setbit key offset value
# (pass)

# setex key seconds value
# 設定變數存活秒數
# ttl 可以查到還可活多久
> setex mykey 60 redis
OK
> ttl mykey
(integer) 55
> get mykey
"redis"
> ttl mykey
(integer) 46

# setnx key value
# 不存在時, 以唯讀方式寫入(之後無法複寫)
> setnx job "coding"
(integer) 1
> setnx job "accounting"
(integer) 0
> get job
"coding"

# setrange key offset value
# 從第 offset字開始, 覆蓋掉原本的東西
> set key1 "0123456789"
OK
> setrange k 3 xxx
(integer) 10
> get k
"012xxx6789"

# strlen key
# 查字串長度
> set k "0123456789"
OK
> strlen k
(integer) 10
> strlen tony
(integer) 0

# mset key value [key value ...]
# 一次設定多個 key-value
> mset name1 'tony' name2 'tiffany'
OK

# msetnx key value [key value ...]
# 所有 key都設置成功 回傳 1; 反之其一失敗, 則全部 rollback, 回傳 0
> msetnx kk1 v1 kk2 v2
(integer) 1

# psetex key milliseconds value
# 變數存活時間 (多久後到期)
> psetex live_10_seconds 10000 hi
# 10秒後, live_10_seconds 將會變成 (nil)

# pttl key
# 查看 key還可存活多久(毫秒); 已經過期的話, 顯示「(integer) -2」; 可永久存活的變數, 顯示「(integer) -1」
> pttl live_10_seconds
(integer) 5541
> set live_forever 100
OK
> pttl live_forever
(integer) -1

# incr key
# +=1 的概念
> incr x
(integer) 1
> incr x
(integer) 2

# incrby key increment
# 遞增整數
> incrby y 500
(integer) 500

# incrbyfloat key increment - http://www.runoob.com/redis/strings-incrbyfloat.html
# 遞增小數
> incrbyfloat g 5.5
"5.5"

# decr key
# 每次 -1
> decr minus_1
(integer) -1
> decr minus_1
(integer) -2

# decrby key decrement
> decrby minus_me 100
(integer) -100

# append key value
# 對字串作 附加, 回傳子串長度
> append qq 100
(integer) 3
>append qq hi
(integer) 5
> get qq
"100hi"
```