# [Lists](http://www.runoob.com/redis/redis-lists.html)

> Redis 的簡易字串列表, 依照加入順序排序. 可以 加在 最左邊 or 最右邊

```bash
# lpush key value [value ...]
# 加入 value 到 key 的最左邊
> lpush db mysql
(integer) 1
> lpush db mongodb
(integer) 2
> lpush db redis
(integer) 3
> lrange db 0 5
1) "mysql"
2) "mongodb"
3) "redis"

# rpush key value [value ...]
# (同 lpush)

# blpop key [key ...] timeout
# 此指令會 block I/O! 等待 timeout秒. 彈出後, 資料不放回; 取得列表 「第 1 個」
# 時間到後, 拿不到東西則回傳「(nil)」
> blpop db 30
1) "db"
2) "redis"
> lrange db 0 5
1) "mongodb"
2) "mysql"

# brpop key [key ...] timeout
# (同 blpop); 取得列表 「最後一個」

# BRPOPLPUSH SOURCE DESTINATION TIMEOUT
# 從列表中 取出加到另外一個列表(等待 timeout秒)
> b`rpoplpush` msg reciver 500
# 此時, block住了!
# 開另一個 Redis CLI
> lpush msg hi
# 原本那個 terminal 就瞬間擷取 msg的 hi, 並且把它 "hi" 加到 reciver. 並顯示等待了 47.04秒
"hi"
(47.04s)
> lrange reciver 0 5
1) "hi"
> lrange msg 0 5
(empty list or set)

# RPOPLPUSH SOURCE DESTINATION
# (同 BRPOPLPUSH), 但馬上執行, 無值顯示 (nil)

# lindex key value
> lpush g1 hello
(integer) 1
> lpush g1 world
(integer) 1
> lrange g1 0 5
1) world
2) hello
> lindex g1 0
"world"
> lindex g1 1
"hello"
> lindex g1 -1
"hello"
> lindex g1 -2
"world"

# linsert key BEFORE|AFTER pivot value
# 把 value 塞到 key 裡的 pivot 前/後
# 成功後回傳 列表長度
# 回傳  0 表示找不到 pivot位置 (插入失敗)
# 回傳 -1 表示找不到  key 或者此 key 為 空列表 (插入失敗)
> rpush uu hello
(integer) 1
> rpush uu world
(integer) 1
> linsert uu before world there
(integer) 3
> lrange uu 0 5
1) "hello"
2) "there"
3) "world"

# llen key
> llen uu
(integer) 3

# lpop key
# 回傳並彈出 key中 第1個
> lpop uu
"hello"

# lpushx key value
# 把值加入到「已存在」列表的第 1個
> lpushx key_that_doesnot_exists 1
(integer) 0
> lpush uu 3
(integer) 3
> lrange uu 0 5
1) "3"
2) "there"
3) "world"

# lrem key count value
# 移除 key中, 與 value相同的值, 移除 count個
# count > 0, 表示從列表 第一個開始找起; count < 0, 表示從列表 最後一個 往前找起; count = 0, 移除全部.
> lpush aa 1 2 3 1 2 3 1 2 3
(integer) 9
> lrem aa -2 1
(integer) 2
> lrange aa 0 -1
1) "3"
2) "2"
3) "1"
4) "3"
5) "2"
6) "3"
7) "2"

# lset key index value
# 利用 index位置, 該 列表內的值
> rpush ss a b c d e
(integer) 5
> lrange ss 0 5
1) "a"
2) "b"
3) "c"
4) "d"
5) "e"
> lset ss 3 xx
OK
> lrange ss 0 5
1) "a"
2) "b"
3) "c"
4) "xx"
5) "e"

# LTRIM KEY START STOP
# 修剪列表, 只保留索引內的範圍
> rpush dd a b c d e f g
(integer) 7
> ltrim dd 2 5
OK
> lrange dd 0 -1
1) "c"
2) "d"
3) "e"
4) "f"

# RPOP KEY
> rpush ff one two three
(integer) 3
127.0.0.1:6379> lrange ff 0 5
1) "one"
2) "two"
3) "three"
127.0.0.1:6379> rpop ff
"three"
> lrange ff 0 5
1) "one"
2) "two"

# RPUSHX KEY VALUE
# 用來把值放到「已存在」的 key 列表最右方(最新一筆)
> rpush yy "A001"
(integer) 1
> rpush yy "A002"
(integer) 2
> rpushx yyyyy "A003"
(integer) 0
> lrange yy 0 -1
1) "A001"
2) "A002"
> lrange yyyyy 0 -1
(empty list or set)
```