#!/bin/bash
# Linux 的 MailBox, 基本上為於 /var/spool/mail/<user>
#

exit 0
# --------------------------------------------------------------------------------------------------------------------

### 收信 / 開啟 mailbox
mail

### 寄信1: 互動式方式寄信
mail -s "這是信件主旨" tony
#Hello~~~  I am GOD!!
#.   # 輸入「.」代表結束
#EOT

### 寄信2: 使用資料劉重導向
mail -s "這是信件主旨" tony <~/content2tony

### 寄信3: 使用管線
ls -al ~ | mail -s "這是信件主旨" tony

### ==================================== 環境變數 ====================================
echo $MAIL # /var/spool/mail/tony

### ================== postfix mailbox 互動式操作 ==================
## 列出 all mails
h

## 刪除目前指標指示的 mail
d

## 離開 mailbox
q

##
